# Pandas

https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf

In [12]:
import pandas as pd
import numpy as np

## Series

In [4]:
s = pd.Series([0.2, 0.4, 0.5])

In [5]:
s

0    0.2
1    0.4
2    0.5
dtype: float64

In [6]:
"_ " * 64

'_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ '

In [10]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
s.values

array([0.2, 0.4, 0.5])

In [14]:
s[0]

0.2

In [23]:
s1 = pd.Series([1, 2, 4, 8], index=["a", "b", "c", "d"])

In [24]:
s1

a    1
b    2
c    4
d    8
dtype: int64

In [25]:
s1[0]

1

In [26]:
s1["a"]

1

In [27]:
s1 * 2

a     2
b     4
c     8
d    16
dtype: int64

In [28]:
np.exp(s1)

a       2.718282
b       7.389056
c      54.598150
d    2980.957987
dtype: float64

In [29]:
s2 = pd.Series({"banane": 2, "kiwi": 3, "mangue": 5, "pomme": 1, "mandarine": 1.5})

In [31]:
s2

banane       2.0
kiwi         3.0
mangue       5.0
pomme        1.0
mandarine    1.5
dtype: float64

In [32]:
s2 > 2

banane       False
kiwi          True
mangue        True
pomme        False
mandarine    False
dtype: bool

In [38]:
s2[s2 > 2]

kiwi      3.0
mangue    5.0
dtype: float64

In [35]:
s2[(s2 > 2) | (s2 < 1.5)]

kiwi      3.0
mangue    5.0
pomme     1.0
dtype: float64

In [36]:
(s2 > 2) | (s2 < 1.5)

banane       False
kiwi          True
mangue        True
pomme         True
mandarine    False
dtype: bool

`|` équivaut à "ou" et se tape en faisant:  sur Mac alt + shift + l ; sur windows : alt gr + 6 


`&` équivaut à "et"

In [58]:
s2[["banane", "kiwi", "pomme"]][s2 >= 2]

banane    2.0
kiwi      3.0
dtype: float64

```
SELECT *
FROM s2
WHERE 
    price >= 2
    and name IN ("banane", "kiwi", "pomme")
```

In [63]:
s2.min() # sum, mean, min, max, median

1.0

In [64]:
"banane" in s2

True

In [65]:
"tomate" in s2

False

In [66]:
s2

banane       2.0
kiwi         3.0
mangue       5.0
pomme        1.0
mandarine    1.5
dtype: float64

In [67]:
s3 = pd.Series({"tomate": 1, "pomme": 1.5, "kiwi": 4})

In [71]:
s3

tomate    1.0
pomme     1.5
kiwi      4.0
dtype: float64

In [74]:
r1 = s2 + s3

In [70]:
# NaN = Not A Number ------> c'est la valeur nulle en numpy (équivaut à None en Python)

In [73]:
np.NaN + 1.0

nan

In [77]:
r1[r1.notnull()]

kiwi     7.0
pomme    2.5
dtype: float64

In [78]:
r1[r1.isnull()]

banane      NaN
mandarine   NaN
mangue      NaN
tomate      NaN
dtype: float64

In [79]:
s2 * s3

banane        NaN
kiwi         12.0
mandarine     NaN
mangue        NaN
pomme         1.5
tomate        NaN
dtype: float64

In [83]:
r1[r1.isnull()].index

Index(['banane', 'mandarine', 'mangue', 'tomate'], dtype='object')

## Dataframe

In [84]:
# Collection de pd.Series en lignes et colonnes

In [109]:
data = {
    "city": ["Paris", "London", "Berlin"],
    "density": [3550, 5100, 3750],
    "area": [2723, 1623, 984],
    "population": [9645000, 8278000, 3675000],
}

In [110]:
df = pd.DataFrame(data)

In [87]:
df

     city  density  area  population
0   Paris     3550  2723     9645000
1  London     5100  1623     8278000
2  Berlin     3750   984     3675000

In [89]:
type(df["city"])

pandas.core.series.Series

In [90]:
type(df)

pandas.core.frame.DataFrame

In [92]:
df.dtypes

city          object
density        int64
area           int64
population     int64
dtype: object

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        3 non-null      object
 1   density     3 non-null      int64
 2   area        3 non-null      int64
 3   population  3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [95]:
df.describe()

           density         area    population
count     3.000000     3.000000  3.000000e+00
mean   4133.333333  1776.666667  7.199333e+06
std     843.109325   879.625110  3.127757e+06
min    3550.000000   984.000000  3.675000e+06
25%    3650.000000  1303.500000  5.976500e+06
50%    3750.000000  1623.000000  8.278000e+06
75%    4425.000000  2173.000000  8.961500e+06
max    5100.000000  2723.000000  9.645000e+06

In [96]:
df.values

array([['Paris', 3550, 2723, 9645000],
       ['London', 5100, 1623, 8278000],
       ['Berlin', 3750, 984, 3675000]], dtype=object)

In [97]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [98]:
df.columns

Index(['city', 'density', 'area', 'population'], dtype='object')

In [111]:
df.columns = ['city_name', 'density', 'area', 'population']  # renommer une colonne

In [116]:
df

  city_name  density  area  population
0     Paris     3550  2723     9645000
1    London     5100  1623     8278000
2    Berlin     3750   984     3675000

In [117]:
df = df.set_index("city_name")  # df.set_index("city_name", inplace=True)

In [118]:
df

           density  area  population
city_name
Paris         3550  2723     9645000
London        5100  1623     8278000
Berlin        3750   984     3675000

In [133]:
# df.loc[]                                         et df.iloc[]
# ^ permet d'accéder à la donnée via les labels       ^ permet d'accéder à la donnée via les index numériques
# loc commence par l donc labels                        iloc commence par i donc index

In [122]:
df.loc["Paris", "area"]
#      ^ lignes  ^ colonnes

2723

In [127]:
df.loc[:, "area"]  # idem à df["area"]
#      ^ toutes les lignes et la colonne area

city_name
Paris     2723
London    1623
Berlin     984
Name: area, dtype: int64

In [129]:
df.loc[["Paris", "London"], "area"]

city_name
Paris     2723
London    1623
Name: area, dtype: int64

In [131]:
df.loc[["Paris", "London"], ["area", "population"]]

           density  area  population
city_name
Paris         3550  2723     9645000
London        5100  1623     8278000

In [149]:
df.loc[:,"density":"population"]

           density  area  population
city_name
Paris         3550  2723     9645000
London        5100  1623     8278000
Berlin        3750   984     3675000

In [138]:
df.iloc[0,-1]

9645000

In [139]:
df.iloc[0,1:]  # ligne 0 et toutes les colonnes sauf la premiere

area             2723
population    9645000
Name: Paris, dtype: int64

In [155]:
df.iloc[0,1:5]  # je récupére la ligne 0 et les 5 premieres colonnes

area             2723
population    9645000
Name: Paris, dtype: int64

In [150]:
df["area"]

city_name
Paris     2723
London    1623
Berlin     984
Name: area, dtype: int64

In [151]:
df[["area", "population"]]

           area  population
city_name
Paris      2723     9645000
London     1623     8278000
Berlin      984     3675000

In [160]:
df.loc[df["area"] > 1500, "density"]

city_name
Paris     3550
London    5100
Name: density, dtype: int64

In [161]:
df[df["area"] > 1500]["density"]

city_name
Paris     3550
London    5100
Name: density, dtype: int64

In [162]:
df

           density  area  population
city_name
Paris         3550  2723     9645000
London        5100  1623     8278000
Berlin        3750   984     3675000

In [164]:
df["computed_density"] = df["population"] / df["area"]

In [166]:
df[df["density"] > 4000]

           density  area  population  computed_density
city_name
London        5100  1623     8278000         5100.4313

In [173]:
df

           density  area  population  computed_density
city_name
Paris         3550  2723     9645000       3542.049210
London        5100  1623     8278000       5100.431300
Berlin        3750   984     3675000       3734.756098

In [168]:
df.sort_values("density", ascending=False)

           density  area  population  computed_density
city_name
London        5100  1623     8278000       5100.431300
Berlin        3750   984     3675000       3734.756098
Paris         3550  2723     9645000       3542.049210

In [172]:
df.sort_index()

           density  area  population  computed_density
city_name
Berlin        3750   984     3675000       3734.756098
London        5100  1623     8278000       5100.431300
Paris         3550  2723     9645000       3542.049210

In [174]:
df.sort_index()

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_add_numeric_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_align_frame',
 '_align_series',
 '_arith_method',
 '_attrs',
 '_box_col_values',
 '_builtin_table',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_cython_table',
 '_data',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flags',
 '_from_arrays',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_item_cache',
 '_iter_column_arrays',
 '_ix',
 '_ixs',
 '_join_compat',
 '_logical_func',
 '_logical_method',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'area',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'computed_density',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'density',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'population',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [180]:
~(df["density"] != 5100)  # > < >= <= != ==
# ~ est le negatif d'un masque booléen

city_name
Paris     False
London     True
Berlin    False
Name: density, dtype: bool

## Read `prenoms.csv`

In [257]:
df = pd.read_csv("prenoms.csv", sep=";")

In [192]:
df.head()

      prenom genre     nb
0     Michel     M  14136
1      Alain     M  10646
2   Philippe     M   9903
3    Bernard     M   8992
4  Christian     M   8102

In [188]:
!head prenoms.csv

Reverting to default Node version
Now using node v14.15.4 (npm v7.6.0)
Reverting to default Node version
Now using node v14.15.4 (npm v7.6.0)
Reverting to default Node version
Now using node v14.15.4 (npm v7.6.0)
"prenom";"genre";"nb"
"Michel";"M";14136
"Alain";"M";10646
"Philippe";"M";9903
"Bernard";"M";8992
"Christian";"M";8102
"Daniel";"M";7821
"Gérard";"M";7009
"Jean-Pierre";"M";6945
"Patrick";"M";6884

In [196]:
df[df["prenom"] != "Alain"]["nb"].sum()

# SELECT SUM(nb)
# FROM prenoms
# WHERE prenom != "Alain"

516331

In [198]:
df[df["genre"] == "M"]["genre"].count()

6581

In [201]:
df[df["genre"] == "F"]["genre"].count()

5886

In [213]:
df.groupby("genre")["prenom"].count()

# SELECT COUNT(nb)
# FROM prenoms
# GROUP BY genre

genre
F    5885
M    6580
Name: prenom, dtype: int64

In [217]:
df["genre"].value_counts()

M    6581
F    5886
Name: genre, dtype: int64

```
SELECT > []
FROM read_csv
WHERE []
GROUP BY .groupby
ORDER BY .sort_values
```

### Jointures

In [219]:
sex_reference = pd.DataFrame({
    "sex": ["M", "F", "O"],
    "sex_label": ["Male", "Female", "Other"],
})

In [220]:
sex_reference

  sex sex_label
0   M      Male
1   F    Female
2   O     Other

In [221]:
df

          prenom genre     nb
0         Michel     M  14136
1          Alain     M  10646
2       Philippe     M   9903
3        Bernard     M   8992
4      Christian     M   8102
...          ...   ...    ...
12462  F.Jacques     M      1
12463     Frédie     F      1
12464     Efisia     F      1
12465     Cosima     F      1
12466   Florisse     F      1

[12467 rows x 3 columns]

In [231]:
df.merge(sex_reference, left_on="genre", right_on="sex", how="inner")

            prenom genre    nb sex sex_label
0           Daniel     M  7821   M      Male
1           Gérard     M  7009   M      Male
2      Jean-Pierre     M  6945   M      Male
3          Patrick     M  6884   M      Male
4           Pierre     M  6711   M      Male
...            ...   ...   ...  ..       ...
12457    Kimberley     F     1   F    Female
12458       Frédie     F     1   F    Female
12459       Efisia     F     1   F    Female
12460       Cosima     F     1   F    Female
12461     Florisse     F     1   F    Female

[12462 rows x 5 columns]

```
A, B, C

A join B > A'
A' join C > resultat
```

In [234]:
sex_reference.columns = ["genre", "genre_label"]

In [235]:
sex_reference

  genre genre_label
0     M        Male
1     F      Female
2     O       Other

In [243]:
df.set_index("genre").join(sex_reference.set_index("genre"), how="inner")

      genre                prenom    nb genre_label
0         F             Catherine  4389      Female
1         F             Françoise  4334      Female
2         F              Isabelle  4295      Female
3         F                Sylvie  4197      Female
4         F               Martine  4094      Female
...     ...                   ...   ...         ...
12457     M           Elefthérios     1        Male
12458     M  Patrice Bernard Jean     1        Male
12459     M                Desire     1        Male
12460     M          Pierre Emile     1        Male
12461     M             F.Jacques     1        Male

[12462 rows x 4 columns]

In [252]:
sex_reference.set_index("genre").reset_index()

  genre genre_label
0     M        Male
1     F      Female
2     O       Other

In [253]:
df["genre"].unique()

array(['D', 'M', 'F'], dtype=object)

In [254]:
df["genre"].nunique()

3

In [255]:
df.tail()

          prenom genre  nb
12462  F.Jacques     M   1
12463     Frédie     F   1
12464     Efisia     F   1
12465     Cosima     F   1
12466   Florisse     F   1

### Question : trouver le nombre de prénoms qui sont androgynes

In [258]:
df

          prenom genre     nb
0         Michel     M  14136
1          Alain     M  10646
2       Philippe     M   9903
3        Bernard     M   8992
4      Christian     M   8102
...          ...   ...    ...
12462  F.Jacques     M      1
12463     Frédie     F      1
12464     Efisia     F      1
12465     Cosima     F      1
12466   Florisse     F      1

[12467 rows x 3 columns]

In [264]:
df["prenom"].value_counts() == 2

Jacky             True
Marie-Danièle     True
Marie-Anne        True
Marianne          True
Jean Paul         True
                 ...
Jacque           False
Gwennaelle       False
Johanes          False
Herbert          False
Don Jean         False
Name: prenom, Length: 11719, dtype: bool

In [263]:
(df["prenom"].value_counts() == 2).sum()

746

In [271]:
groups = df["prenom"].value_counts()

In [278]:
df[df["prenom"].isin(groups[groups == 2].index)]["nb"].sum()

475951

In [279]:
groups[groups == 2].count()

746